const hre = require('hardhat')
const util = require('util')
const { prepareStrategy } = require('../lib/encode')
const { uniqueNamesGenerator, adjectives, colors, animals, countries, languages } = require('unique-names-generator')
// prettier-ignore
const emojis = ['😄','😃','😀','😊','☺','😉','😍','😘','😚','😗','😙','😜','😝','😛','😳','😁','😔','😌','😒','😞','😣','😢','😂','😭','😪','😥','😰','😅','😓','😩','😫','😨','😱','😠','😡','😤','😖','😆','😋','😷','😎','😴','😵','😲','😟','😦','😧','😈','👿','😮','😬','😐','😕','😯','😶','😇','😏','😑','👲','👳','👮','👷','💂','👶','👦','👧','👨','👩','👴','👵','👱','👼','👸','😺','😸','😻','😽','😼','🙀','😿','😹','😾','👹','👺','🙈','🙉','🙊','💀','👽','💩','🔥','✨','🌟','💫','💥','💢','💦','💧','💤','💨','👂','👀','👃','👅','👄','👍','👎','👌','👊','✊','✌','👋','✋','👐','👆','👇','👉','👈','🙌','🙏','☝','👏','💪','🚶','🏃','💃','👫','👪','👬','👭','💏','💑','👯','🙆','🙅','💁','🙋','💆','💇','💅','👰','🙎','🙍','🙇','🎩','👑','👒','👟','👞','👡','👠','👢','👕','👔','👚','👗','🎽','👖','👘','👙','💼','👜','👝','👛','👓','🎀','🌂','💄','💛','💙','💜','💚','❤','💔','💗','💓','💕','💖','💞','💘','💌','💋','💍','💎','👤','👥','💬','👣','💭','🐶','🐺','🐱','🐭','🐹','🐰','🐸','🐯','🐨','🐻','🐷','🐽','🐮','🐗','🐵','🐒','🐴','🐑','🐘','🐼','🐧','🐦','🐤','🐥','🐣','🐔','🐍','🐢','🐛','🐝','🐜','🐞','🐌','🐙','🐚','🐠','🐟','🐬','🐳','🐋','🐄','🐏','🐀','🐃','🐅','🐇','🐉','🐎','🐐','🐓','🐕','🐖','🐁','🐂','🐲','🐡','🐊','🐫','🐪','🐆','🐈','🐩','🐾','💐','🌸','🌷','🍀','🌹','🌻','🌺','🍁','🍃','🍂','🌿','🌾','🍄','🌵','🌴','🌲','🌳','🌰','🌱','🌼','🌐','🌞','🌝','🌚','🌑','🌒','🌓','🌔','🌕','🌖','🌗','🌘','🌜','🌛','🌙','🌍','🌎','🌏','🌋','🌌','🌠','⭐','☀','⛅','☁','⚡','☔','❄','⛄','🌀','🌁','🌈','🌊','🎍','💝','🎎','🎒','🎓','🎏','🎆','🎇','🎐','🎑','🎃','👻','🎅','🎄','🎁','🎋','🎉','🎊','🎈','🎌','🔮','🎥','📷','📹','📼','💿','📀','💽','💾','💻','📱','☎','📞','📟','📠','📡','📺','📻','🔊','🔉','🔈','🔇','🔔','🔕','📢','📣','⏳','⌛','⏰','⌚','🔓','🔒','🔏','🔐','🔑','🔎','💡','🔦','🔆','🔅','🔌','🔋','🔍','🛁','🛀','🚿','🚽','🔧','🔩','🔨','🚪','🚬','💣','🔫','🔪','💊','💉','💰','💴','💵','💷','💶','💳','💸','📲','📧','📥','📤','✉','📩','📨','📯','📫','📪','📬','📭','📮','📦','📝','📄','📃','📑','📊','📈','📉','📜','📋','📅','📆','📇','📁','📂','✂','📌','📎','✒','✏','📏','📐','📕','📗','📘','📙','📓','📔','📒','📚','📖','🔖','📛','🔬','🔭','📰','🎨','🎬','🎤','🎧','🎼','🎵','🎶','🎹','🎻','🎺','🎷','🎸','👾','🎮','🃏','🎴','🀄','🎲','🎯','🏈','🏀','⚽','⚾','🎾','🎱','🏉','🎳','⛳','🚵','🚴','🏁','🏇','🏆','🎿','🏂','🏊','🏄','🎣','☕','🍵','🍶','🍼','🍺','🍻','🍸','🍹','🍷','🍴','🍕','🍔','🍟','🍗','🍖','🍝','🍛','🍤','🍱','🍣','🍥','🍙','🍘','🍚','🍜','🍲','🍢','🍡','🍳','🍞','🍩','🍮','🍦','🍨','🍧','🎂','🍰','🍪','🍫','🍬','🍭','🍯','🍎','🍏','🍊','🍋','🍒','🍇','🍉','🍓','🍑','🍈','🍌','🍐','🍍','🍠','🍆','🍅','🌽','🏠','🏡','🏫','🏢','🏣','🏥','🏦','🏪','🏩','🏨','💒','⛪','🏬','🏤','🌇','🌆','🏯','🏰','⛺','🏭','🗼','🗾','🗻','🌄','🌅','🌃','🗽','🌉','🎠','🎡','⛲','🎢','🚢','⛵','🚤','🚣','⚓','🚀','✈','💺','🚁','🚂','🚊','🚉','🚞','🚆','🚄','🚅','🚈','🚇','🚝','🚋','🚃','🚎','🚌','🚍','🚙','🚘','🚗','🚕','🚖','🚛','🚚','🚨','🚓','🚔','🚒','🚑','🚐','🚲','🚡','🚟','🚠','🚜','💈','🚏','🎫','🚦','🚥','⚠','🚧','🔰','⛽','🏮','🎰','♨','🗿','🎪','🎭','📍','🚩','⬆','⬇','⬅','➡','🔠','🔡','🔤','↗','↖','↘','↙','↔','↕','🔄','◀','▶','🔼','🔽','↩','↪','ℹ','⏪','⏩','⏫','⏬','⤵','⤴','🆗','🔀','🔁','🔂','🆕','🆙','🆒','🆓','🆖','📶','🎦','🈁','🈯','🈳','🈵','🈴','🈲','🉐','🈹','🈺','🈶','🈚','🚻','🚹','🚺','🚼','🚾','🚰','🚮','🅿','♿','🚭','🈷','🈸','🈂','Ⓜ','🛂','🛄','🛅','🛃','🉑','㊙','㊗','🆑','🆘','🆔','🚫','🔞','📵','🚯','🚱','🚳','🚷','🚸','⛔','✳','❇','❎','✅','✴','💟','🆚','📳','📴','🅰','🅱','🆎','🅾','💠','➿','♻','♈','♉','♊','♋','♌','♍','♎','♏','♐','♑','♒','♓','⛎','🔯','🏧','💹','💲','💱','©','®','™','〽','〰','🔝','🔚','🔙','🔛','🔜','❌','⭕','❗','❓','❕','❔','🔃','🕛','🕧','🕐','🕜','🕑','🕝','🕒','🕞','🕓','🕟','🕔','🕠','🕕','🕖','🕗','🕘','🕙','🕚','🕡','🕢','🕣','🕤','🕥','🕦','✖','➕','➖','➗','♠','♥','♣','♦','💮','💯','✔','☑','🔘','🔗','➰','🔱','🔲','🔳','◼','◻','◾','◽','▪','▫','🔺','⬜','⬛','⚫','⚪','🔴','🔵','🔻','🔶','🔷','🔸','🔹'];
const randomEmoji = () => emojis[Math.floor(Math.random() * emojis.length)]

if (!process.env.CRAWLER_DATA_PATH) throw 'set env CRAWLER_DATA_PATH'
const positions = require(process.env.CRAWLER_DATA_PATH + '/token_positions.json')
const tokens = require(process.env.CRAWLER_DATA_PATH + '/tokens.json')

const network = hre.network.name
const deployments = require('../deployments.json')

if (!deployments || !deployments[network]) throw 'no deployment for network ' + network

if (!tokens) throw 'no tokens imported from json!'
if (!positions) throw 'no positions imported from json!'

const filteredTokens = Object.keys(tokens)
	.filter((token) => {
		const protocol = tokens[token].protocol
		return protocol !== 1 && protocol !== 11
	})
	.filter((token) => positions[token])
console.log('Total Tokens: ', filteredTokens.length)

const createStrategies = async (matrix: any, factory: any, signer: string) => {
	let success = 0
	for (let i = 0; i < matrix.length; i++) {
		const createStrategyArgs = matrix[i]
		if (createStrategyArgs) {
			try {
				let tx = await factory.connect(signer).createStrategy(...createStrategyArgs)
				let receipt = await tx.wait()
				success++
				console.log('Strategy create gas used: ', receipt.gasUsed.toString())
			} catch (e) {
				const errMessage = `Failed to create a strategy at index: ${i}. \n ${e.message} \n ${JSON.stringify(
					createStrategyArgs,
					null,
					2
				)}`
				console.error(errMessage)
			}
		}
	}
	console.log(`Successfully deployed ${((success * 100) / matrix.length).toFixed(2)}% of strategies.`)
}

const main = async () => {
	const [signer] = await hre.ethers.getSigners()

	const strategyFactory = await hre.ethers.getContractAt(
		'StrategyProxyFactory',
		deployments[network].StrategyProxyFactory
	)

	const routerAddress = deployments[network].LoopRouter

	const amount = hre.ethers.BigNumber.from('1000000000000000')
	const createStrategyArgsMatrix = filteredTokens.map((token) => {
		const emoji = randomEmoji()

		const strategyName = uniqueNamesGenerator({
			dictionaries: [adjectives, colors, languages, animals],
			style: 'capital',
			separator: ' ',
		})

		const strategySymbol = strategyName
			.split(' ')
			.map((word: string) => word[0])
			.join('')

		let position = positions[token]
		position.adapters = position.adapters.map((adapterName: string) =>
			adapterName === 'YearnV2Adapter'
				? (deployments[network] as any)['YEarnV2Adapter']
				: (deployments[network] as any)[adapterName]
		)
		position.percentage = 1000
		const strategyItems = prepareStrategy([position], deployments[network].UniswapV3Adapter)
		const isSocial = Math.random() > 0.05
		let fee = isSocial ? 100 : 0
		const strategyState = {
			timelock: 60,
			rebalanceThreshold: 10,
			rebalanceSlippage: 995,
			restructureSlippage: 1,
			performanceFee: fee,
			social: isSocial,
			set: false,
		}
		return [
			signer.address,
			`${emoji} ${strategyName} ${emoji}`,
			strategySymbol,
			strategyItems,
			strategyState,
			routerAddress,
			'0x',
			{ value: amount, gasLimit: 5000000 },
		]
	})
	await createStrategies(createStrategyArgsMatrix, strategyFactory, signer)
}

main()
	.then(() => process.exit(0))
	.catch((error) => {
		console.error(error)
		process.exit(1)
	})
